import numpy as np
from cv2 import imread


def deconstruct_image(path: str, base_vecs: np.ndarray):
    # что такое base_vecs см. в описании ф-ции construct_image
    img = imread(path, 0)  # Читаем изображение в градациях черого в 2Darray
    base_coeffs = np.linalg.lstsq(base_vecs, img.flatten())[0]
    return base_coeffs


def construct_image(coeffs, base_vecs, n1, n2):
    """
    Генерация изображения по заданным коэффициентам разложения изображения в некотором базисе.

    Для создания изображения используется формула для представления вектора 
    как суммы произведения координат вектора на соответсвующие базисные векторы.

    Параметры:
    --------------------
        coeffs : np.ndarray
            Набор коэффициентов разложения изображения по базисным векторам
        base_vecs : np.ndarray 
            Набор базисных векторов разложения
        n1 : int
            Размер изображения по оси х
        n2 : int
            Размер изображения по оси у

    Результат работы функции:
    ------------------------------
        construct_image : np.ndarray
            Изображение восстановленное по коэффициентам некоторого разложения
    """

    # Используем функцию скалярного произведения для суммирования произведений 
    # коэффициентов на базисные векторы, затем меняем размер массива для получения изображения
    return (np.dot(base_vecs, coeffs)).reshape((n1, n2))
